app/Models/jbModel.php

    public function AllData()
    {
        return $this->db->table('jenis_beasiswa')->Get()->getResultArray();
---
SELECT *
FROM `jenis_beasiswa`