app/Models/kaModel.php

    public function AllData()
    {
        return $this->db->table('laporan_keaktifan')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_keaktifan.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_keaktifan.id_penerima', 'left')
            ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
            ->Get()->getResultArray();
---
SELECT *
FROM `laporan_keaktifan`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_keaktifan`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_keaktifan`.`id_penerima`

    public function DetailData($id_keaktifan)
    {
        return $this->db->table('laporan_keaktifan')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_keaktifan.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_keaktifan.id_penerima', 'left')
            ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
            ->where('id_keaktifan', $id_keaktifan)->get()->getRowArray();
---
SELECT *
FROM `laporan_keaktifan`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_keaktifan`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_keaktifan`.`id_penerima`
LEFT JOIN `program_studi` ON `program_studi`.`id_prodi` = `penerima_beasiswa`.`id_prodi`
WHERE `id_keaktifan` = '1'