app/Models/laModel.php

SELECT *
FROM `laporan_akademik`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_akademik`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_akademik`.`id_penerima`
---
    public function AllData()
    {
        return $this->db->table('laporan_akademik')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_akademik.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_akademik.id_penerima', 'left')
            ->Get()->getResultArray();