app/Models/lgfModel.php

    public function AllData()
    {
        return $this->db->table('link_gform')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=link_gform.id_beasiswa', 'left')
            ->Get()->getResultArray();
---
SELECT *
FROM `link_gform`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`link_gform`.`id_beasiswa`

    public function DeleteData($data)
    {
        $this->db->table('link_gform')->where('id_lgf', $data['id_lgf'])->delete($data);
---
DELETE FROM `link_gform`
WHERE `id_lgf` = '5'
AND `id_lgf` = '5'