app/Models/loginModel.php

    public function login_check_a($username, $password)
    {
        return $this->db->table('user')
        ->where(array('username' => $username, 'password' => $password))
        ->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = '10120700'
AND `password` = 'umul'