app/Models/logModel.php

INSERT INTO `log_aktivitas` (`log_last_login`, `log_username`) VALUES ('2024-05-24 21:09:20', '10120700')
---
    public function InsertData($data)
    {
        $this->db->table('log_aktivitas')->insert(($data));