app/Models/lpModel.php

SELECT *
FROM `laporan_prestasi`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_prestasi`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_prestasi`.`id_penerima`
LEFT JOIN `program_studi` ON `program_studi`.`id_prodi` = `penerima_beasiswa`.`id_prodi`
WHERE `konfirmasi_prestasi` = 2
---
    public function GetProcessData(){
        return $this->db->table('laporan_prestasi')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_prestasi.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_prestasi.id_penerima', 'left')
            ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
            ->where('konfirmasi_prestasi',2)->Get()->getResultArray();