app/Models/mbkmModel.php

SELECT *
FROM `laporan_mbkm`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_mbkm`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_mbkm`.`id_penerima`
LEFT JOIN `program_studi` ON `program_studi`.`id_prodi` = `penerima_beasiswa`.`id_prodi`
WHERE `konfirmasi_mbkm` = 2
---
    public function GetProcessData(){
        return $this->db->table('laporan_mbkm')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_mbkm.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_mbkm.id_penerima', 'left')
            ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
            ->where('konfirmasi_mbkm',2)->Get()->getResultArray();

SELECT *
FROM `laporan_mbkm`
LEFT JOIN `jenis_beasiswa` ON `jenis_beasiswa`.`id_beasiswa`=`laporan_mbkm`.`id_beasiswa`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`id_penerima`=`laporan_mbkm`.`id_penerima`
LEFT JOIN `program_studi` ON `program_studi`.`id_prodi` = `penerima_beasiswa`.`id_prodi`
---
    public function AllData()
    {
        return $this->db->table('laporan_mbkm')
            ->join('jenis_beasiswa', 'jenis_beasiswa.id_beasiswa=laporan_mbkm.id_beasiswa', 'left')
            ->join('penerima_beasiswa', 'penerima_beasiswa.id_penerima=laporan_mbkm.id_penerima', 'left')
            ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
            ->Get()->getResultArray();