app/Models/newsModel.php

SELECT *
FROM `pengumuman`
---
    public function AllData()
    {
        return $this->db->table('pengumuman')->Get()->getResultArray();