app/Models/pbModel.php

SELECT *
FROM `penerima_beasiswa`
---
    public function AllData()
    {
        return $this->db->table('penerima_beasiswa')->Get()->getResultArray();