app/Models/pbModel.php

    public function AllData()
    {
        return $this->select('penerima_beasiswa.*, program_studi.id_prodi, program_studi.nama')
        return $this->db->table('penerima_beasiswa')
        ->join('program_studi', 'program_studi.id_prodi = penerima_beasiswa.id_prodi', 'left')
        ->Get()->getResultArray();
---
SELECT *
FROM `penerima_beasiswa`
LEFT JOIN `program_studi` ON `program_studi`.`id_prodi` = `penerima_beasiswa`.`id_prodi`