app/Models/prodiModel.php

SELECT *
FROM `program_studi`
---
    public function AllData()
    {
        return $this->db->table('program_studi')->Get()->getResultArray();