app/Models/tahunModel.php

    public function AllData()
    {
        return $this->db->table('tahun_ajaran')->Get()->getResultArray();
---
SELECT *
FROM `tahun_ajaran`