app/Models/userModel.php

SELECT `user`.*, `penerima_beasiswa`.`ppicture`, `penerima_beasiswa`.`nama`
FROM `user`
LEFT JOIN `penerima_beasiswa` ON `penerima_beasiswa`.`npm` = `user`.`username`
---
    public function getAllUsersWithProfile()
{
    return $this->db->table('user')
        ->select('user.*, penerima_beasiswa.ppicture, penerima_beasiswa.nama') // Tambahkan nama dari tabel penerima_beasiswa
        ->join('penerima_beasiswa', 'penerima_beasiswa.npm = user.username', 'left') // Left Join dengan kondisi username = npm
        ->get()
        ->getResultArray(); // Ambil semua hasil dalam bentuk array asosiatif

UPDATE `user` SET `id_user` = '3', `username` = '10120700', `password` = 'umul', `hak_akses` = '1', `last_login` = '2024-05-24', `status_user` = '1'
WHERE `id_user` = '3'
---
    public function UpdateData($id, $data)
    {
        return $this->db->table('user')->where('id_user', $id)->update($data);